lib/tasks/export_data.rake

SELECT "languages".* FROM "languages"
---
  task :export_to_seeds => :environment do
    # We call the Alignment table via the ruby object of the same name, and dump each line of the table into the block variable "alignments"
    Language.all.each do |language|