lib/tasks/export_data.rake

  task :export_to_seeds => :environment do
    # We call the Alignment table via the ruby object of the same name, and dump each line of the table into the block variable "alignments"
    Alignment.all.each do |alignments|
---
SELECT "alignments".* FROM "alignments"