app/controllers/api/alignments_controller.rb

SELECT "alignments".* FROM "alignments"
---
  def index
    # render json: "message: Chaotic Evil is bad"
    @alignments = Alignment.all

SELECT "alignments".* FROM "alignments" WHERE "alignments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @alignment = Alignment.find_by(id: params[:id])

INSERT INTO "alignments" ("name", "abbreviation", "desc", "imgurl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @alignment = Alignment.new(
      name: params[:name],
      abbreviation: params[:abbreviation],
      desc: params[:desc],
      imgurl: params[:imgurl],
    )

    if @alignment.save

SELECT "alignments".* FROM "alignments" WHERE "alignments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "alignments" WHERE "alignments"."id" = $1  [["id", 10]]
---
  def destroy
    alignment = Alignment.find(params[:id])
    alignment.destroy