app/controllers/api/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    # render json: "message: Chaotic Evil is bad"
    @characters = Character.all

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @character = Character.find_by(id: params[:id])

INSERT INTO "characters" ("userid", "cfirstname", "cmiddlename", "clastname", "raceid", "classid", "alignmentid", "languageid", "inventoryid", "strength", "dexterity", "constitution", "intelligence", "wisdom", "charisma", "healthmax", "healthcurrent", "healthtemp", "speed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @character = Character.new(
      userid: params[:userid],
      cfirstname: params[:cfirstname],
      cmiddlename: params[:cmiddlename],
      clastname: params[:clastname],
      raceid: params[:raceid],
      classid: params[:classid],
      alignmentid: params[:alignmentid],
      languageid: params[:languageid],
      inventoryid: params[:inventoryid],
      strength: params[:strength],
      dexterity: params[:dexterity],
      constitution: params[:constitution],
      intelligence: params[:intelligence],
      wisdom: params[:wisdom],
      charisma: params[:charisma],
      healthmax: params[:healthmax],
      healthcurrent: params[:healthcurrent],
      healthtemp: params[:healthtemp],
      speed: params[:speed],
      origin_story: params[:origin_story],
    )

    if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "characters" SET "cfirstname" = $1, "cmiddlename" = $2, "clastname" = $3, "raceid" = $4, "classid" = $5, "alignmentid" = $6, "languageid" = $7, "inventoryid" = $8, "strength" = $9, "dexterity" = $10, "constitution" = $11, "intelligence" = $12, "wisdom" = $13, "charisma" = $14, "healthmax" = $15, "healthcurrent" = $16, "healthtemp" = $17, "speed" = $18, "updated_at" = $19 WHERE "characters"."id" = $20
---
  def update
    @character = Character.find(params[:id])
    @character.userid = params[:userid] || @character.userid
    @character.cfirstname = params[:cfirstname] || @character.cfirstname
    @character.cmiddlename = params[:cmiddlename] || @character.cmiddlename
    @character.clastname = params[:clastname] || @character.clastname
    @character.raceid = params[:raceid] || @character.raceid
    @character.classid = params[:classid] || @character.classid
    @character.alignmentid = params[:alignmentid] || @character.alignmentid
    @character.languageid = params[:languageid] || @character.languageid
    @character.inventoryid = params[:inventoryid] || @character.inventoryid
    @character.strength = params[:strength] || @character.strength
    @character.dexterity = params[:dexterity] || @character.dexterity
    @character.constitution = params[:constitution] || @character.constitution
    @character.intelligence = params[:intelligence] || @character.intelligence
    @character.wisdom = params[:wisdom] || @character.wisdom
    @character.charisma = params[:charisma] || @character.charisma
    @character.healthmax = params[:healthmax] || @character.healthmax
    @character.healthcurrent = params[:healthcurrent] || @character.healthcurrent
    @character.healthtemp = params[:healthtemp] || @character.healthtemp
    @character.speed = params[:speed] || @character.speed
    @character.origin_story = params[:origin_story] || @character.origin_story

    if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 5]]
---
  def destroy
    character = Character.find(params[:id])
    character.destroy