app/controllers/api/equipments_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    # render json: "message: Chaotic Evil is bad"
    @equipments = Equipment.all

SELECT "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @equipment = Equipment.find_by(id: params[:id])