app/controllers/api/languages_controller.rb

  def index
    # render json: "message: Chaotic Evil is bad"
    @languages = Language.all
---
SELECT "languages".* FROM "languages"