app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render json: "message: People are signing up!"
    if current_user
      @users = User.all

INSERT INTO "users" ("ufirstname", "ulastname", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # password -> what user types in
    # password_digest, after hashing, saved in db

    @user = User.new(
      # May not need user ID
      # username: params[:username],

      userid: params[:id],
      email: params[:email],
      ufirstname: params[:ufirstname],
      ulastname: params[:ulastname],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      characterid: params[:characterid],
    )
    if @user.save

UPDATE "users" SET "ufirstname" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["ufirstname", "Michael"], ["password_digest", "$2a$12$AdYdtNapDwTTuZbHmUj99eVF/N4nhMRBap6rWjxD11GFFJmQoqRCK"], ["updated_at", "2021-05-05 00:11:29.307279"], ["id", 1]]
---
  def update
    @user = current_user
    @user.userid = params[:id] || @user.id
    @user.email = params[:email] || @user.email
    @user.ufirstname = params[:ufirstname] || @user.ufirstname
    @user.ulastname = params[:ulastname] || @user.ulastname
    @user.password = params[:password] || @user.password
    @user.characterid = params[:characterid] || @user.characterid

    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
  def destroy
    user = current_user
    user.destroy