app/controllers/api/users_controller.rb

INSERT INTO "users" ("ufirstname", "ulastname", "email", "userid", "characterid", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # password -> what user types in
    # password_digest, after hashing, saved in db

    @user = User.new(
      userid: params[:userid],
      email: params[:email],
      ufirstname: params[:ufirstname],
      ulastname: params[:ulastname],
      # username: params[:username],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      characterid: params[:characterid],
    )
    if @user.save